# -*- coding: utf-8 -*-
import networkx as nx
import matplotlib.pyplot as plt

# 站点列表
stations = [
            "奥体中心", "元通", "中胜", "小行", "安德门", "中华门", "三山街", "张府园", "新街口", "珠江路", "鼓楼", "玄武门", "新模范马路",
            "南京站", "红山动物园", "迈皋桥", "天隆寺", "软件大道", "花神庙", "南京南站", "双龙大道", "河定桥", "胜太路", "百家湖", "小龙湾",
            "竹山路", "天印大道", "龙眠大道", "南医大江苏经贸学院", "南京交院", "中国药科大学"

    
            "油坊桥", "雨润大街", "奥体东", "兴隆大街", "集庆门大街", "云锦路", "莫愁湖", "汉中门", "上海路", "大行宫",
            "西安门", "明故宫", "苜蓿园", "下马坊", "孝陵卫", "钟灵街", "马群", "金马路", "仙鹤门", "学则路",
            "仙林中心", "羊山公园", "南大仙林校区", "经天路",

            "林场", "星火路", "东大成贤学院", "天润城", "柳洲东路", "上元门", "五塘广场",
            "小市", "南京林业大学新庄", "鸡鸣寺","浮桥", "常府街", "夫子庙", "武定门", "雨花门", "卡子门", "大明路",
            "明发广场", "宏运大道", "胜太西路", "天元西路", "九龙湖", "诚信大道", "东大九龙湖校区", "秣周东路"


            "龙江", "南艺二师草场门", "云南路", "九华山", "岗子村", "蒋王庙", "王家湾", "聚宝山", "苏宁总部徐庄",
            "汇通路", "灵山", "东流", "孟北", "西岗桦墅", "仙林湖",

            "梦都大街", "绿博园", "江心洲", "临江", "浦口万汇城", "南京工业大学", "龙华路", "文德路", "雨山路",

            "禄口机场", "翔宇路南", "翔宇路北", "正方中路", "吉印大道", "河海大学佛城西路", "翠屏山",

            "泰山新村", "泰冯路", "高新开发区", "信息工程大学", "卸甲甸", "大厂", "葛塘", "长芦", "化工园",
            "六合开发区", "龙池", "雄州", "凤凰山公园", "方州广场", "沈桥", "八百桥", "金牛湖"]

# 创建图
G = nx.Graph()

# 添加节点
for station in stations:
    G.add_node(station)

# 定义站点之间的连接（边）
connections = [
    ##一号线
    ("奥体中心", "元通"), ("元通", "中胜"), ("中胜", "小行"), ("小行", "安德门"),("安德门", "中华门"), ("中华门", "三山街"),
    ("三山街", "张府园"), ("张府园", "新街口"), ("新街口", "珠江路"), ("珠江路", "鼓楼"),("鼓楼", "玄武门"), ("玄武门", "新模范马路"),
    ("新模范马路", "南京站"), ("南京站", "红山动物园"), ("红山动物园", "迈皋桥"),
    ("安德门", "天隆寺"),("天隆寺", "软件大道"),("软件大道", "花神庙"), ("花神庙", "南京南站"), ("南京南站", "双龙大道"), ("双龙大道", "河定桥"),
    ("河定桥", "胜太路"),("胜太路", "百家湖"), ("百家湖", "小龙湾"), ("小龙湾", "竹山路"), ("竹山路", "天印大道"), ("天印大道", "龙眠大道"),
    ("龙眠大道", "南医大江苏经贸学院"), ("南医大江苏经贸学院", "南京交院"), ("南京交院", "中国药科大学"),

    ##二号线
    ("油坊桥", "雨润大街"), ("雨润大街", "奥体东"), ("奥体东", "兴隆大街"),
    ("兴隆大街", "集庆门大街"), ("集庆门大街", "云锦路"), ("云锦路", "莫愁湖"),
    ("莫愁湖", "汉中门"), ("汉中门", "上海路"), ("上海路", "新街口"),("新街口", "大行宫"),
    ("大行宫", "西安门"), ("西安门", "明故宫"), ("明故宫", "苜蓿园"),
    ("苜蓿园", "下马坊"), ("下马坊", "孝陵卫"), ("孝陵卫", "钟灵街"),
    ("钟灵街", "马群"), ("马群", "金马路"), ("金马路", "仙鹤门"),
    ("仙鹤门", "学则路"), ("学则路", "仙林中心"), ("仙林中心", "羊山公园"),
    ("羊山公园", "南大仙林校区"), ("南大仙林校区", "经天路"),

    ##三号线
    ("林场", "星火路"), ("星火路", "东大成贤学院"), ("东大成贤学院", "天润城"),
    ("天润城", "柳洲东路"), ("柳洲东路", "上元门"), ("上元门", "五塘广场"),
    ("五塘广场", "小市"), ("小市", "南京站"),("南京站", "南京林业大学新庄"), ("南京林业大学新庄", "鸡鸣寺"),
    ("鸡鸣寺", "浮桥"),("浮桥", "大行宫"), ("大行宫", "常府街"), ("常府街", "夫子庙"), ("夫子庙", "武定门"),
    ("武定门", "雨花门"), ("雨花门", "卡子门"), ("卡子门", "大明路"), ("大明路", "明发广场"),
    ("明发广场", "南京南站"), ("南京南站", "宏运大道"),("宏运大道", "胜太西路"), ("胜太西路", "天元西路"),
    ("天元西路", "九龙湖"), ("九龙湖", "诚信大道"), ("诚信大道", "东大九龙湖校区"), ("东大九龙湖校区", "秣周东路"),

    ##四号线
    ("龙江", "南艺二师草场门"), ("南艺二师草场门", "云南路"),("云南路", "鼓楼"),
    ("鼓楼", "鸡鸣寺"), ("鸡鸣寺", "九华山"), ("九华山", "岗子村"), ("岗子村", "蒋王庙"),
    ("蒋王庙", "王家湾"), ("王家湾", "聚宝山"), ("聚宝山", "苏宁总部徐庄"),
    ("苏宁总部徐庄", "金马路"), ("金马路", "汇通路"), ("汇通路", "灵山"), ("灵山", "东流"),
    ("东流", "孟北"), ("孟北", "西岗桦墅"), ("西岗桦墅", "仙林湖"),

    ##十号线
    ("奥体中心", "梦都大街"), ("梦都大街", "绿博园"), ("绿博园", "江心洲"),
    ("江心洲", "临江"), ("临江", "浦口万汇城"), ("浦口万汇城", "南京工业大学"),
    ("南京工业大学", "龙华路"), ("龙华路", "文德路"), ("文德路", "雨山路"),

    ##S1
    ("禄口机场", "翔宇路南"), ("翔宇路南", "翔宇路北"),("翔宇路北", "正方中路"),
    ("正方中路", "吉印大道"), ("吉印大道", "河海大学佛城西路"),("河海大学佛城西路", "翠屏山"), ("翠屏山", "南京南站"),

    ##S8
    ("泰山新村", "泰冯路"),("泰冯路", "高新开发区"), ("高新开发区", "信息工程大学"),
    ("信息工程大学", "卸甲甸"),("卸甲甸", "大厂"), ("大厂", "葛塘"), ("葛塘", "长芦"),
    ("长芦", "化工园"), ("化工园", "六合开发区"), ("六合开发区", "龙池"),
    ("龙池", "雄州"), ("雄州", "凤凰山公园"), ("凤凰山公园", "方州广场"),
    ("方州广场", "沈桥"), ("沈桥", "八百桥"), ("八百桥", "金牛湖"),


]

# 添加边
G.add_edges_from(connections)

# 绘制图
plt.figure(figsize=(12, 12))
nx.draw(G, with_labels=True, node_size=500, node_color="skyblue", font_size=10, font_color="black", font_weight="bold",
        edge_color="gray")
plt.title("地铁网络")
plt.show()
